%%%-------------------------------------------------------------------
%%% @author
%%% @copyright (C) 2016, THYZ
%%% @doc             通用 record 定义
%%% @end
%%% Created : 26. 五月 2016 下午 4:08
%%%-------------------------------------------------------------------
%% ----------------------------------
%% @doc 	玩家连接状态
%% @end
%% ----------------------------------
-record(conn, {
    ip,                 %% 玩家IP
    socket,             %% 玩家套接字
    sender_worker,      %% 玩家发送进程
    player_id,          %% 玩家ID
    acc_id,             %% 帐号id
    server_id,          %% 服务器id
    status,             %% 状态
    create_time = 0,    %% 创建时间
    login_time = 0,     %% 登录时间
    recv_count = 0,     %% 收到的包数量
    error_count = 0,    %% 错误包数量
    buff = <<>>,
    socket_mod
%%    seq = 0             %% 包序
}).
